app/views/deals/new.rb

      def view_template
        render Components::PageHeader.new(page_title)

        div(class: "mt-8 max-w-4xl mx-auto") do
          div(class: "bg-white shadow-sm ring-1 ring-gray-900/5 sm:rounded-xl") do
            div(class: "px-4 py-6 sm:p-8") do
              render Components::Form.new(action: deals_path, method: :post) do |form|
                form.section(
                  title: "Informações Básicas",
                  description: "Dados principais do deal"
                ) do |section|
                  section.text :title,
                    label: "Título",
                    span: 4,
                    placeholder: "Ex: Desenvolvedor Senior Ruby"

                  section.email :contact_email,
                    label: "Email de contato",
                    span: 4,
                    placeholder: "you@example.com",
                    value: "adamwathan",
                    error: "Not a valid email address."

                  section.select :agency_id,
                    label: "Agência",
                    span: 3,
                    options: agencies.map { |a| { value: a.id, label: a.name } },
                    selected: deal.agency_id

                  section.select :recruter_id,
                    label: "Recrutador",
                    span: 3,
                    options: recruiters.map { |r| { value: r.id, label: r.name } },
                    selected: deal.recruter_id,
                    disabled: true
---
SELECT "agencies".* FROM "agencies" ORDER BY "agencies"."name" ASC
SELECT "recruters".* FROM "recruters" ORDER BY "recruters"."name" ASC