app/controllers/agencies_controller.rb

  def index
    @agencies = Agency.all
---
SELECT "agencies".* FROM "agencies"

  def create
    @agency = Agency.new(agency_params)

    respond_to do |format|
      if @agency.save
---
INSERT INTO "agencies" ("name", "created_at", "updated_at") VALUES ('', '2025-11-26 20:26:45.767480', '2025-11-26 20:26:45.767480') RETURNING "id"

    def set_agency
      @agency = Agency.find(params.expect(:id))
---
SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" = 5 LIMIT 1