app/controllers/recruters_controller.rb

  def index
    @recruters = Recruter.all
---
SELECT "recruters".* FROM "recruters"

    def set_recruter
      @recruter = Recruter.find(params.expect(:id))
---
SELECT "recruters".* FROM "recruters" WHERE "recruters"."id" = 5 LIMIT 1